Revit 2027 API
AnalyticalPowerDistributableNodeData.AssignedPhasesNumber Property
 The number of electrical phases assigned through the distribution system of the power distributable node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int AssignedPhasesNumber { get; }
Public ReadOnly Property AssignedPhasesNumber As Integer
	Get
public:
property int AssignedPhasesNumber {
	int get ();
}
member AssignedPhasesNumber : int with get
Property Value
Int32
See Also
Reference
AnalyticalPowerDistributableNodeData Class
Autodesk.Revit.DB.Electrical Namespace